eisup_2019_docmng_integration/src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыСообщений/ВидыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСообщений</name>
  <enumValues>
    <name>Раздел</name>
  </enumValues>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>ВажнаяИнформация</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаСворачиваемаяСИтогами</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/InformationRegisters/ФИОФизЛиц/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Предупредим о "последствиях" пустой фамилии
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.Фамилия) Тогда
			СтрокаСообщенияОбОшибке = "Для физического лица " + СтрокаНабора.ФизЛицо + " не указана фамилия. Возможны ошибки представления в отчетах! " + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаСообщенияОбОшибке) Тогда
		#Если Клиент Тогда
			ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
			ОбработкаКомментариев.УдалитьСообщения();
			ОбработкаКомментариев.ДобавитьСообщение(СтрокаСообщенияОбОшибке, Перечисления.ВидыСообщений.ВажнаяИнформация);
			ОбработкаКомментариев.ПоказатьСообщения();
		#Иначе
			Сообщить(СтрокаСообщенияОбОшибке, СтатусСообщения.Внимание);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры
